//=========================================================
// src/first_main.c: 하드웨어 구성에 의해 생성됨
//
// 이 파일은 문서를 저장할 때 업데이트됩니다.
// 구역을 안에 두다 "$[...]" 주석 태그 단독
// 그렇지 않으면 덮어쓰게 됩니다!!
//=========================================================

//-----------------------------------------------------------------------------
// 포함하다
//-----------------------------------------------------------------------------
#include <SI_EFM8BB52_Register_Enums.h>                  // 특정 기능을 수행하는 레지스터를 선언
#include "InitDevice.h"
#include <stdio.h>
#include <stdint.h>

//-----------------------------------------------------------------------------
// SiLabs_Startup() 루틴
// ----------------------------------------------------------------------------
// 이 함수는 리셋 직후, 초기화 코드가 실행되기 전에 호출됩니다.
// 초기화 코드는 main() 함수보다 먼저 실행되는 SILABS_STARTUP.A51에서 실행됩니다. 이것은
// 기본적으로 활성화되어 있는 워치독 타이머를 비활성화하기에 유용한 장소입니다. 워치독:감시견
// 경우에 따라 main() 함수가 실행되기 전에 워치독 타이머가 트리거될 수 있습니다.
//-----------------------------------------------------------------------------
void
SiLabs_Startup (void)
{
}

//-----------------------------------------------------------------------------
// 지연 함수
// ----------------------------------------------------------------------------
void
delay (uint32_t count)
{
  uint32_t i;
  for (i = 0; i < count; i++)
    {
      // 아무것도 하지 않습니다. 단순히 시간을 지연시키기 위해 루프를 돈다.
    }
}

void sli(){
  delay (5000);
  P3=0xfE;
}





//-----------------------------------------------------------------------------
// main() 루틴
// ----------------------------------------------------------------------------
int
main (void)
{
  enter_DefaultMode_from_RESET ();
while(1){
  if(P1==0x03||P1==0x01){
     P3 = 0xEF;
     P0 = 0xfd;
     if(P1==0x02){
         continue;
     }
     delay (50000);
     sli();
     P0 = 0xFb;
     if(P1==0x02){
              continue;
          }
     delay (50000);
     P0 = 0xF7;
     if(P1==0x02){
              continue;
          }
     delay (50000);

  }else {
      P3 = 0xf7;
      P0 = 0xff;
  }
  if(P1==0x00||P1==0x01){
      P3=0xfE;
      delay (20000);
  }

}



}
